#存放部分roi信息
#PC16_9: 桌面端 16:9 设备
#Android16_9：模拟器16:9设备

class PC16_9:
        Page_L_1 = [205,155,155,155] 
        Page_L_2 = [345,155,155,155] 
        Page_L_3 = [465,155,155,155]
        Page_L_4 = [205,315,155,155]
        Page_L_5 = [345,315,155,155]
        Page_L_6 = [465,315,155,155]
        Page_L_7 = [205,465,155,155]
        Page_L_8 = [315,465,155,155]
        Page_L_9 = [465,465,155,155]

        Page_R_1 = [625,155,155,155]
        Page_R_2 = [765,155,155,155]
        Page_R_3 = [885,155,155,155]
        Page_R_4 = [625,315,155,155]
        Page_R_5 = [765,315,155,155]
        Page_R_6 = [885,315,155,155]
        Page_R_7 = [625,465,155,155]
        Page_R_8 = [765,465,155,155]
        Page_R_9 = [885,465,155,155]

        roi_location = {"Left":{"1":Page_L_1,"2":Page_L_2,"3":Page_L_3,"4":Page_L_4,"5":Page_L_5,"6":Page_L_6,"7":Page_L_7,"8":Page_L_8,"9":Page_L_9},
                "Right":{"1":Page_R_1,"2":Page_R_2,"3":Page_R_3,"4":Page_R_4,"5":Page_R_5,"6":Page_R_6,"7":Page_R_7,"8":Page_R_8,"9":Page_R_9}}
        
        roi_getmap = [70,80,120,25]
        roi_getplayer = [250,45,100,40]
        roi_getreputation = [0,0,0,0]
        
class Android16_9:
        Page_L_1 = [235,140,150,150] 
        Page_L_2 = [365,140,150,150] 
        Page_L_3 = [495,140,150,150]
        Page_L_4 = [235,300,150,150]
        Page_L_5 = [365,300,150,150]
        Page_L_6 = [495,300,150,150]
        Page_L_7 = [235,460,150,150]
        Page_L_8 = [365,460,150,150]
        Page_L_9 = [495,460,150,150]

        Page_R_1 = [665,140,150,150]
        Page_R_2 = [795,140,150,150]
        Page_R_3 = [925,140,150,150]
        Page_R_4 = [695,300,150,150]
        Page_R_5 = [795,300,150,150]
        Page_R_6 = [925,300,150,150]
        Page_R_7 = [665,460,150,150]
        Page_R_8 = [795,460,150,150]
        Page_R_9 = [925,460,150,150]

        roi_location = {"Left":{"1":Page_L_1,"2":Page_L_2,"3":Page_L_3,"4":Page_L_4,"5":Page_L_5,"6":Page_L_6,"7":Page_L_7,"8":Page_L_8,"9":Page_L_9},
                "Right":{"1":Page_R_1,"2":Page_R_2,"3":Page_R_3,"4":Page_R_4,"5":Page_R_5,"6":Page_R_6,"7":Page_R_7,"8":Page_R_8,"9":Page_R_9}}
        
        roi_getmap = [75,45,120,40]
        roi_getplayer = [270,10,90,40]
        
        roi_getreputation = [535,445,75,35]
        roi_getweekly = [460,30,65,35]